#include <IRremoteESP8266.h> //  Подключаем библиотеку IRremoteESP8266
#include <IRsend.h>

const uint16_t kIrLed = 1;  // D2, рекомендованный ПИН ИК передатчика
IRsend irsend(kIrLed);

// Пример массива необработанных данных
//uint16_t rawData[67] = {4524, 4510,  554, 1720,  528, 1696,  552, 1696,  552, 568,  556, 570,  554, 568,  556, 568,  554, 570,  552, 1694,  554, 1696,  552, 1696,  552, 568,  554, 570,  554, 568,  556, 570,  554, 570,  556, 568,  554, 568,  556, 1694,  552, 568,  556, 570,  554, 570,  552, 570,  554, 568,  556, 1698,  550, 1698,  550, 570,  554, 1694,  554, 1696,  552, 1696,  552, 1696,  552, 1698,  550};

void setup() {
  Serial.begin(115200);
  irsend.begin();  // Инициализируем ИК передатчик
}

void loop() {
  Serial.println("NEC");
  irsend.sendNEC("0xFF02FD"); // Отправляем данные по протоколу NEC
  delay(2000);
  /*
  Serial.println("Sony");
  irsend.sendSony(0xa90, 12, 2);  // Отправляем данные по Sony SIRC 12 бит/2-ое повторение
  delay(2000);
  Serial.println("Raw data");
  irsend.sendRaw(rawData, 67, 38);  // Отправляем необработанные данные, размер 67/частота 38 кГц
  delay(2000);
  */
}
